# Data Visualization using Pandas

## Importing the necessary libraries

In [1]:
import pandas as pd
import numpy as np

## Intro to Dataframes

In [2]:
df = pd.DataFrame([[1,2],[4,5],[6,7]])
df

   0  1
0  1  2
1  4  5
2  6  7

In [3]:
df = pd.DataFrame([[1,2],[4,5],[6,7]], columns = ["A","B"])
df

   A  B
0  1  2
1  4  5
2  6  7

In [4]:
df = pd.DataFrame([[1,2],[4,5],[6,7]], columns = ["A","B"], index=["x","y","z"])
df

   A  B
x  1  2
y  4  5
z  6  7

In [5]:
df.columns

Index(['A', 'B'], dtype='object')

In [6]:
df.index

Index(['x', 'y', 'z'], dtype='object')

### **Indices are the rows and columns are columns**
#### You can use .tolist after index and columns to get it in list format

In [7]:
df.index.tolist()

['x', 'y', 'z']

In [8]:
df.columns.tolist()

['A', 'B']

In [9]:
df.head()

   A  B
x  1  2
y  4  5
z  6  7

In [10]:
df.tail()

   A  B
x  1  2
y  4  5
z  6  7

#### df.head() only gives the first 5 data rows and df.tail() gives the last 5

In [11]:
df.head(1)

   A  B
x  1  2

In [12]:
df.head(2)

   A  B
x  1  2
y  4  5

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
dtypes: int64(2)
memory usage: 72.0+ bytes

#### Gives information regarding the dataframe

In [14]:
df.describe()

              A         B
count  3.000000  3.000000
mean   3.666667  4.666667
std    2.516611  2.516611
min    1.000000  2.000000
25%    2.500000  3.500000
50%    4.000000  5.000000
75%    5.000000  6.000000
max    6.000000  7.000000

#### Gives meaningful information regarding the dataframe

In [15]:
df.nunique()

A    3
B    3
dtype: int64

#### Gives the number of non unique values in each row
#### can be specfically done on one row as well as shown

In [16]:
df['A'].nunique()

3

In [17]:
df['A'].unique()

array([1, 4, 6], dtype=int64)

In [18]:
df.shape

(3, 2)

#### Gives the shape of the dataframe

In [19]:
df.size

6

#### Total Number of spaces ( no. of rows multiplied by no. of columns)